{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "microsoft/Phi-3.5-vision-instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.layers.13.self_attn.o_proj",
    "model.layers.25.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.5.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.8.self_attn.v_proj",
    "model.layers.6.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.17.self_attn.k_proj",
    "model.layers.11.self_attn.o_proj",
    "model.layers.31.mlp.gate_up_proj",
    "model.layers.17.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.15.mlp.fc1",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.3.self_attn.q_proj",
    "model.layers.27.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.3.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.12.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.2.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.9.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.2.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.18.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.10.self_attn.out_proj",
    "model.layers.14.self_attn.qkv_proj",
    "model.layers.22.self_attn.o_proj",
    "model.layers.26.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.0.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.6.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.16.mlp.fc1",
    "model.layers.12.mlp.down_proj",
    "model.vision_embed_tokens.img_projection.0",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.23.self_attn.q_proj",
    "model.layers.24.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.embeddings.position_embedding",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.17.self_attn.out_proj",
    "model.layers.27.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.0.mlp.fc1",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.14.self_attn.k_proj",
    "model.layers.6.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.22.mlp.fc1",
    "model.layers.3.mlp.down_proj",
    "model.layers.11.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.12.self_attn.k_proj",
    "model.layers.11.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.13.mlp.fc1",
    "model.layers.21.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.1.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.6.self_attn.q_proj",
    "model.layers.4.mlp.down_proj",
    "model.layers.25.mlp.gate_up_proj",
    "model.layers.28.mlp.down_proj",
    "model.layers.30.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.22.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.19.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.20.self_attn.q_proj",
    "model.layers.21.self_attn.o_proj",
    "model.layers.2.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.21.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.7.self_attn.k_proj",
    "model.layers.10.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.3.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.15.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.22.self_attn.k_proj",
    "model.layers.10.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.23.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.1.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.18.self_attn.k_proj",
    "model.layers.12.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.7.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.10.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.11.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.17.mlp.fc1",
    "model.layers.19.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.19.self_attn.out_proj",
    "model.layers.0.mlp.down_proj",
    "model.layers.14.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.18.mlp.fc1",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.8.self_attn.k_proj",
    "model.layers.30.mlp.gate_up_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.2.self_attn.v_proj",
    "model.layers.30.self_attn.qkv_proj",
    "model.layers.2.mlp.down_proj",
    "model.layers.14.mlp.gate_up_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.12.mlp.fc1",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.15.self_attn.out_proj",
    "model.layers.31.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.6.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.18.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.19.self_attn.q_proj",
    "model.layers.7.self_attn.o_proj",
    "model.layers.9.mlp.gate_up_proj",
    "model.layers.20.mlp.gate_up_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.8.mlp.fc1",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.16.self_attn.k_proj",
    "model.layers.22.mlp.down_proj",
    "model.layers.28.self_attn.qkv_proj",
    "model.layers.5.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.4.self_attn.k_proj",
    "model.layers.10.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.20.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.21.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.13.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.11.self_attn.v_proj",
    "model.layers.4.mlp.gate_up_proj",
    "model.layers.3.self_attn.qkv_proj",
    "model.layers.13.mlp.gate_up_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.5.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.2.mlp.fc1",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.9.self_attn.out_proj",
    "model.layers.9.self_attn.o_proj",
    "model.layers.24.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.22.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.8.self_attn.out_proj",
    "model.layers.17.self_attn.qkv_proj",
    "model.layers.15.self_attn.o_proj",
    "model.layers.26.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.15.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.11.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.13.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.14.self_attn.q_proj",
    "model.layers.2.self_attn.qkv_proj",
    "model.layers.29.mlp.gate_up_proj",
    "model.layers.26.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.20.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.2.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.1.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.5.mlp.fc1",
    "model.layers.1.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.0.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.20.mlp.fc1",
    "model.layers.5.mlp.gate_up_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.3.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.1.mlp.fc2",
    "model.layers.22.mlp.gate_up_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.5.self_attn.q_proj",
    "model.layers.29.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.1.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.21.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.23.mlp.fc1",
    "model.layers.11.mlp.gate_up_proj",
    "model.layers.20.self_attn.o_proj",
    "model.layers.0.self_attn.qkv_proj",
    "model.layers.18.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.14.self_attn.v_proj",
    "model.layers.20.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.5.mlp.fc2",
    "model.layers.26.mlp.gate_up_proj",
    "model.layers.27.self_attn.qkv_proj",
    "model.layers.24.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.23.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.6.mlp.fc1",
    "model.layers.19.mlp.gate_up_proj",
    "model.layers.5.self_attn.qkv_proj",
    "model.layers.8.self_attn.o_proj",
    "model.layers.9.self_attn.qkv_proj",
    "model.layers.17.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.0.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.13.self_attn.q_proj",
    "model.layers.3.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.1.mlp.fc1",
    "model.layers.4.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.7.mlp.fc2",
    "model.layers.29.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.12.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.18.self_attn.v_proj",
    "model.layers.15.mlp.gate_up_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.12.mlp.fc2",
    "model.layers.24.mlp.gate_up_proj",
    "model.layers.7.mlp.gate_up_proj",
    "model.layers.16.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.0.self_attn.v_proj",
    "model.layers.7.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.16.mlp.fc2",
    "model.layers.1.mlp.gate_up_proj",
    "model.layers.3.mlp.gate_up_proj",
    "model.layers.28.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.17.mlp.fc2",
    "model.layers.19.mlp.down_proj",
    "model.layers.23.mlp.gate_up_proj",
    "model.layers.31.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.4.mlp.fc1",
    "model.layers.30.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.7.self_attn.q_proj",
    "model.layers.0.self_attn.o_proj",
    "model.layers.13.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.14.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.8.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.23.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.7.mlp.fc1",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.8.self_attn.q_proj",
    "model.layers.10.mlp.gate_up_proj",
    "model.layers.14.self_attn.o_proj",
    "model.layers.25.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.4.mlp.fc2",
    "model.layers.8.mlp.gate_up_proj",
    "model.layers.15.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.4.self_attn.v_proj",
    "model.layers.23.self_attn.qkv_proj",
    "model.layers.28.mlp.gate_up_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.10.mlp.fc2",
    "model.layers.31.self_attn.qkv_proj",
    "model.layers.2.mlp.gate_up_proj",
    "model.layers.7.self_attn.qkv_proj",
    "model.layers.12.mlp.gate_up_proj",
    "model.layers.20.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.9.self_attn.k_proj",
    "model.layers.23.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.11.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.20.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.16.self_attn.out_proj",
    "model.layers.15.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.19.mlp.fc2",
    "model.layers.8.mlp.down_proj",
    "model.layers.13.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.3.mlp.fc2",
    "model.layers.19.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.10.self_attn.q_proj",
    "model.layers.1.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.14.mlp.fc1",
    "model.layers.21.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.4.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.12.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.15.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.20.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.10.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.23.mlp.fc2",
    "model.layers.16.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.19.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.21.self_attn.v_proj",
    "model.layers.16.mlp.gate_up_proj",
    "model.layers.18.mlp.gate_up_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.17.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.0.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.13.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.2.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.9.self_attn.q_proj",
    "model.layers.21.mlp.gate_up_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.21.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.7.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.16.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.21.mlp.fc1",
    "model.layers.18.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.19.mlp.fc1",
    "model.layers.23.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.17.self_attn.v_proj",
    "model.layers.4.self_attn.qkv_proj",
    "model.layers.18.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.14.self_attn.out_proj",
    "model.layers.6.mlp.gate_up_proj",
    "model.layers.5.self_attn.o_proj",
    "model.layers.16.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.6.self_attn.k_proj",
    "model.layers.27.mlp.gate_up_proj",
    "model.layers.1.mlp.down_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.4.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.18.self_attn.out_proj",
    "model.layers.22.self_attn.qkv_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.11.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.5.self_attn.v_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.9.mlp.fc1",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.10.mlp.fc1",
    "model.layers.9.mlp.down_proj",
    "model.layers.25.self_attn.o_proj",
    "model.layers.0.mlp.gate_up_proj",
    "model.layers.12.self_attn.o_proj",
    "model.vision_embed_tokens.img_projection.2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.13.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.6.self_attn.out_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.9.mlp.fc2",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.3.mlp.fc1",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.16.self_attn.v_proj",
    "model.layers.17.mlp.gate_up_proj",
    "model.layers.6.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.15.self_attn.k_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.22.self_attn.q_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.22.mlp.fc2",
    "model.layers.29.self_attn.o_proj",
    "model.vision_embed_tokens.img_processor.vision_model.encoder.layers.11.mlp.fc1",
    "model.layers.8.self_attn.qkv_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}